{
  "bomFormat" : "CycloneDX",
  "specVersion" : "1.5",
  "serialNumber" : "urn:uuid:5b5c033b-cbf2-4d99-805d-9a84a3022805",
  "version" : 1,
  "metadata" : {
    "timestamp" : "2025-02-23T12:36:22Z",
    "tools" : [
      {
        "vendor" : "OWASP",
        "name" : "Dependency-Track",
        "version" : "4.10.1"
      }
    ],
    "component" : {
      "name" : "ca-certificates-2023.2.64-1.oe2403.src.rpm",
      "version" : "SNAPSHOT",
      "externalReferences" : [
        {
          "type" : "website",
          "url" : "https://fedoraproject.org/wiki/CA-Certificates"
        }
      ],
      "type" : "application",
      "bom-ref" : "0e26c542-894e-4c62-b150-69526d6e4fe9"
    }
  },
  "components" : [
    {
      "name" : "openssl",
      "version" : "3.0.12",
      "description" : "OpenSSL is a robust, commercial-grade, and full-featured toolkit for the Transport Layer Security (TLS) and Secure Sockets Layer (SSL) protocols.",
      "licenses" : [
        {
          "license" : {
            "name" : "OpenSSL and SSLeay"
          }
        }
      ],
      "cpe" : "cpe:2.3:a:*:openssl:3.0.12:*:*:*:*:*:*:*",
      "purl" : "pkg:deb/openssl@3.0.12-15.oe2403?arch=x86_64&upstream=openssl-3.0.12-15.oe2403.src.rpm",
      "externalReferences" : [
        {
          "type" : "website",
          "url" : "https://www.openssl.org/"
        }
      ],
      "type" : "application",
      "bom-ref" : "e2787e80-0072-42c9-ac02-8832883b6efd"
    },
    {
      "name" : "perl",
      "version" : "5.38.0",
      "description" : "Perl 5 is a highly capable, feature-rich programming language with over 30 years of development. Perl 5 runs on over 100 platforms from portables to mainframes and is suitable for both rapid prototyping and large scale development projects.",
      "licenses" : [
        {
          "license" : {
            "name" : "(GPL+ or Artistic) and (GPLv2+ or Artistic) and MIT and UCD and Public Domain and BSD"
          }
        }
      ],
      "cpe" : "cpe:2.3:a:*:perl:5.38.0:*:*:*:*:*:*:*",
      "purl" : "pkg:deb/perl@5.38.0-6.oe2403?arch=x86_64&upstream=perl-5.38.0-6.oe2403.src.rpm",
      "externalReferences" : [
        {
          "type" : "website",
          "url" : "https://www.perl.org/"
        }
      ],
      "type" : "application",
      "bom-ref" : "26bd8612-035d-4d80-aa7d-a419379699f7"
    }
  ],
  "dependencies" : [
    {
      "ref" : "0e26c542-894e-4c62-b150-69526d6e4fe9",
      "dependsOn" : [
        "e2787e80-0072-42c9-ac02-8832883b6efd",
        "26bd8612-035d-4d80-aa7d-a419379699f7"
      ]
    },
    {
      "ref" : "e2787e80-0072-42c9-ac02-8832883b6efd",
      "dependsOn" : [ ]
    },
    {
      "ref" : "26bd8612-035d-4d80-aa7d-a419379699f7",
      "dependsOn" : [ ]
    }
  ],
  "vulnerabilities" : [
    {
      "bom-ref" : "340b9a57-bcdb-4ac4-a317-83d342c11482",
      "id" : "CVE-2024-0727",
      "source" : {
        "name" : "NVD",
        "url" : "https://nvd.nist.gov/"
      },
      "ratings" : [
        {
          "source" : {
            "name" : "NVD",
            "url" : "https://nvd.nist.gov/"
          },
          "score" : 5.5,
          "severity" : "medium",
          "method" : "CVSSv3",
          "vector" : "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H"
        }
      ],
      "description" : "Issue summary: Processing a maliciously formatted PKCS12 file may lead OpenSSL to crash leading to a potential Denial of Service attack Impact summary: Applications loading files in the PKCS12 format from untrusted sources might terminate abruptly. A file in PKCS12 format can contain certificates and keys and may come from an untrusted source. The PKCS12 specification allows certain fields to be NULL, but OpenSSL does not correctly check for this case. This can lead to a NULL pointer dereference that results in OpenSSL crashing. If an application processes PKCS12 files from an untrusted source using the OpenSSL APIs then that application will be vulnerable to this issue. OpenSSL APIs that are vulnerable to this are: PKCS12_parse(), PKCS12_unpack_p7data(), PKCS12_unpack_p7encdata(), PKCS12_unpack_authsafes() and PKCS12_newpass(). We have also fixed a similar issue in SMIME_write_PKCS7(). However since this function is related to writing data we do not consider it security significant. The FIPS modules in 3.2, 3.1 and 3.0 are not affected by this issue.",
      "published" : "2024-01-26T09:15:00Z",
      "updated" : "2024-11-21T08:47:00Z",
      "affects" : [
        {
          "ref" : "e2787e80-0072-42c9-ac02-8832883b6efd"
        }
      ]
    },
    {
      "bom-ref" : "20f576e4-996c-42ef-8a49-f4deddab73ef",
      "id" : "CVE-2023-5678",
      "source" : {
        "name" : "NVD",
        "url" : "https://nvd.nist.gov/"
      },
      "ratings" : [
        {
          "source" : {
            "name" : "NVD",
            "url" : "https://nvd.nist.gov/"
          },
          "score" : 5.3,
          "severity" : "medium",
          "method" : "CVSSv3",
          "vector" : "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L"
        }
      ],
      "cwes" : [
        754
      ],
      "description" : "Issue summary: Generating excessively long X9.42 DH keys or checking excessively long X9.42 DH keys or parameters may be very slow. Impact summary: Applications that use the functions DH_generate_key() to generate an X9.42 DH key may experience long delays. Likewise, applications that use DH_check_pub_key(), DH_check_pub_key_ex() or EVP_PKEY_public_check() to check an X9.42 DH key or X9.42 DH parameters may experience long delays. Where the key or parameters that are being checked have been obtained from an untrusted source this may lead to a Denial of Service. While DH_check() performs all the necessary checks (as of CVE-2023-3817), DH_check_pub_key() doesn't make any of these checks, and is therefore vulnerable for excessively large P and Q parameters. Likewise, while DH_generate_key() performs a check for an excessively large P, it doesn't check for an excessively large Q. An application that calls DH_generate_key() or DH_check_pub_key() and supplies a key or parameters obtained from an untrusted source could be vulnerable to a Denial of Service attack. DH_generate_key() and DH_check_pub_key() are also called by a number of other OpenSSL functions. An application calling any of those other functions may similarly be affected. The other functions affected by this are DH_check_pub_key_ex(), EVP_PKEY_public_check(), and EVP_PKEY_generate(). Also vulnerable are the OpenSSL pkey command line application when using the \"-pubcheck\" option, as well as the OpenSSL genpkey command line application. The OpenSSL SSL/TLS implementation is not affected by this issue. The OpenSSL 3.0 and 3.1 FIPS providers are not affected by this issue.",
      "published" : "2023-11-06T16:15:00Z",
      "updated" : "2024-11-21T08:42:00Z",
      "affects" : [
        {
          "ref" : "e2787e80-0072-42c9-ac02-8832883b6efd"
        }
      ]
    },
    {
      "bom-ref" : "906fcbca-3672-4200-a40f-12d47dda67ac",
      "id" : "CVE-2023-6129",
      "source" : {
        "name" : "NVD",
        "url" : "https://nvd.nist.gov/"
      },
      "ratings" : [
        {
          "source" : {
            "name" : "NVD",
            "url" : "https://nvd.nist.gov/"
          },
          "score" : 6.5,
          "severity" : "medium",
          "method" : "CVSSv3",
          "vector" : "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:H"
        }
      ],
      "cwes" : [
        787
      ],
      "description" : "Issue summary: The POLY1305 MAC (message authentication code) implementation contains a bug that might corrupt the internal state of applications running on PowerPC CPU based platforms if the CPU provides vector instructions. Impact summary: If an attacker can influence whether the POLY1305 MAC algorithm is used, the application state might be corrupted with various application dependent consequences. The POLY1305 MAC (message authentication code) implementation in OpenSSL for PowerPC CPUs restores the contents of vector registers in a different order than they are saved. Thus the contents of some of these vector registers are corrupted when returning to the caller. The vulnerable code is used only on newer PowerPC processors supporting the PowerISA 2.07 instructions. The consequences of this kind of internal application state corruption can be various - from no consequences, if the calling application does not depend on the contents of non-volatile XMM registers at all, to the worst consequences, where the attacker could get complete control of the application process. However unless the compiler uses the vector registers for storing pointers, the most likely consequence, if any, would be an incorrect result of some application dependent calculations or a crash leading to a denial of service. The POLY1305 MAC algorithm is most frequently used as part of the CHACHA20-POLY1305 AEAD (authenticated encryption with associated data) algorithm. The most common usage of this AEAD cipher is with TLS protocol versions 1.2 and 1.3. If this cipher is enabled on the server a malicious client can influence whether this AEAD cipher is used. This implies that TLS server applications using OpenSSL can be potentially impacted. However we are currently not aware of any concrete application that would be affected by this issue therefore we consider this a Low severity security issue.",
      "published" : "2024-01-09T17:15:00Z",
      "updated" : "2024-11-21T08:43:00Z",
      "affects" : [
        {
          "ref" : "e2787e80-0072-42c9-ac02-8832883b6efd"
        }
      ]
    },
    {
      "bom-ref" : "080ed676-4b2f-4871-9c55-71cba0c41b53",
      "id" : "CVE-2023-47100",
      "source" : {
        "name" : "NVD",
        "url" : "https://nvd.nist.gov/"
      },
      "ratings" : [
        {
          "source" : {
            "name" : "NVD",
            "url" : "https://nvd.nist.gov/"
          },
          "score" : 9.8,
          "severity" : "critical",
          "method" : "CVSSv3",
          "vector" : "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
        }
      ],
      "cwes" : [
        755
      ],
      "description" : "In Perl before 5.38.2, S_parse_uniprop_string in regcomp.c can write to unallocated space because a property name associated with a \\p{...} regular expression construct is mishandled. The earliest affected version is 5.30.0.",
      "published" : "2023-12-02T23:15:00Z",
      "updated" : "2024-11-21T08:29:00Z",
      "affects" : [
        {
          "ref" : "26bd8612-035d-4d80-aa7d-a419379699f7"
        }
      ]
    }
  ]
}